app/controllers/authentication_controller.rb

  def login
    user = User.find_by(phonenumber: params[:phonenumber])
---
SELECT "users".* FROM "users" WHERE "users"."phonenumber" = ? LIMIT ?  [["phonenumber", "57654356"], ["LIMIT", 1]]

  def admin
    user = User.find_by(phonenumber: params[:phonenumber])
---
SELECT "users".* FROM "users" WHERE "users"."phonenumber" = ? LIMIT ?  [["phonenumber", ""], ["LIMIT", 1]]