app/controllers/bookings_controller.rb

  def create
    from = Station.find_by(station_name: booking_params[:from]).fare
    to = Station.find_by(station_name: booking_params[:to]).fare

    #find absolute difference
    diff = (from - to).abs

    #find time now + diff*10 minutes
    time = Time.now + diff * 10 * 60



    new_booking = {
      bus_id: booking_params[:bus_id],
      user_id: params[:user_id],
      from_id: Station.find_by(station_name: booking_params[:from]).id,
      to_id: Station.find_by(station_name: booking_params[:to]).id,
      fare: diff * 10,
      isActive: false,
    }

    booking = Booking.create(new_booking)
---
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = ? LIMIT ?  [["station_name", "Roysa"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = ? LIMIT ?  [["station_name", "CBD"], ["LIMIT", 1]]
INSERT INTO "bookings" ("bus_id", "user_id", "isActive", "from_id", "to_id", "fare", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["bus_id", nil], ["user_id", 0], ["isActive", 0], ["from_id", 2], ["to_id", 0], ["fare", 20], ["created_at", "2023-01-18 05:41:46.172392"], ["updated_at", "2023-01-18 05:41:46.172392"]]

  def pay
    booking = find_booking

    phonenumber = booking.user.phonenumber

    fare = booking.fare

    booking.bus.update(passengers: booking.bus.passengers + 1)
    booking.update(isActive: true)
---
UPDATE "bookings" SET "isActive" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["isActive", 1], ["updated_at", "2023-01-18 07:46:41.144965"], ["id", 15]]

  def find_booking
    Booking.find_by(id: params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]