app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("bus_id", "user_id", "isActive", "from_id", "to_id", "fare", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["bus_id", 4], ["user_id", 1], ["isActive", 0], ["from_id", 2], ["to_id", 1], ["fare", 10], ["created_at", "2023-01-17 21:08:23.847736"], ["updated_at", "2023-01-17 21:08:23.847736"]]
---
    def create
        booking = Booking.create(booking_params)