app/controllers/buses_controller.rb

SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = ? LIMIT ?  [["station_name", "Roysa"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_name" = ? LIMIT ?  [["station_name", "CBD"], ["LIMIT", 1]]
---
  def available
    buses =
      Bus.where(
        from: params_for_available[:from],
        to: params_for_available[:to]
      )

    #select buses where seats are greater than passengers
    to_send_buses = []
    buses.each do |bus|
      puts bus.seater > bus.passengers

      if bus.seater > bus.passengers
        to_send_buses.push(bus)
      end
    end


    fare_from = Station.find_by(station_name: params_for_available[:from]).fare
    fare_to = Station.find_by(station_name: params_for_available[:to]).fare