app/controllers/mpesas_controller.rb

DELETE FROM "access_tokens" WHERE "access_tokens"."id" = ?  [["id", 1]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "[FILTERED]"], ["created_at", "2023-01-19 10:43:13.083912"], ["updated_at", "2023-01-19 10:43:13.083912"]]
---
  def get_access_token
    res = generate_access_token_request()
    if res.code != 200
      r = generate_access_token_request()
      raise MpesaError("Unable to generate access token") if res.code != 200
    end
<<<<<<< HEAD
    body = JSON.parse(res, { symbolize_names: true })
    token = body[:access_token]
    AccessToken.destroy_all()
    AccessToken.create!(token: token)

DELETE FROM "access_tokens" WHERE "access_tokens"."id" = ?  [["id", 7]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "[FILTERED]"], ["created_at", "2023-01-19 07:43:57.892039"], ["updated_at", "2023-01-19 07:43:57.892039"]]
---
    def get_access_token
        res = generate_access_token_request()
        if res.code != 200
        r = generate_access_token_request()
        if res.code != 200
        raise MpesaError('Unable to generate access token')
        end
        end
        body = JSON.parse(res, { symbolize_names: true })
        token = body[:access_token]
        AccessToken.destroy_all()
        AccessToken.create!(token: token)