app/controllers/stations_controller.rb

SELECT "stations".* FROM "stations"
---
    def index
        stations = Station.all

SELECT "stations".* FROM "stations"
---
    def start
        station = Station.all