app/controllers/users_controller.rb

    def create
        if params["password_digest"] == params["confirmpassword"]
            #encrypt password
            new_user = {
                fullname: params["fullname"],
                phonenumber: params["phonenumber"],
                password_digest: BCrypt::Password.create(params["password_digest"])
            }
            user = User.create(new_user)
---
INSERT INTO "users" ("fullname", "phonenumber", "password_digest", "isAdmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)